IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_UART0.xml
	<register id="MEM_EFR" acronym="MEM_EFR" offset="0x8" width="32" description="Enhanced Feature Register">
		<bitfield id="AUTO_CTS_EN" width="1" begin="7" end="7" resetval="0x0" description="Auto-CTS enable bit. 0: Normal operation. 1: Auto-CTS flow control is enabled i.e. transmission is halted when the CTS* pin is high (inactive)." range="7" rwaccess="R/W"/> 
		<bitfield id="AUTO_RTS_EN" width="1" begin="6" end="6" resetval="0x0" description="Auto-RTS enable bit. 0: Normal operation. 1: Auto- RTS flow control is enabled i.e. RTS* pin goes high (inactive) when the receiver FIFO HALT trigger level, TCR[3:0], is reached, and goes low (active) when the receiver FIFO RESTORE transmission trigger level is reached." range="6" rwaccess="R/W"/> 
		<bitfield id="SPECIAL_CHAR_DETECT" width="1" begin="5" end="5" resetval="0x0" description="0: Normal operation. 1: Special character detect enable. Received data is compared with XOFF2 data. If a match occurs the received data is transferred to RX FIFO and IIR bit 4 is set to 1 to indicate a special character has been detected." range="5" rwaccess="R/W"/> 
		<bitfield id="ENHANCED_EN" width="1" begin="4" end="4" resetval="0x0" description="Enhanced functions write enable bit. 0: Disables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7. 1: Enables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7." range="4" rwaccess="R/W"/> 
		<bitfield id="SW_FLOW_CONTROL" width="4" begin="3" end="0" resetval="0x0" description="Combinations of Software flow control can be selected by programming bit 3 - bit 0. See Software Flow Control Options" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_FCR" acronym="MEM_FCR" offset="0x8" width="32" description="Notes:
	Bits 4 and 5 can only be written to when EFR[4] = 1
	Bits 0 to 3 can be changed only when the baud clock is not running (DLL and DLH set to 0)
	See Table 31 for FCR[5:4] setting restriction when SCR[6]=1
	See Table 32 for FCR[7:6] setting restriction when SCR[7]=1">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RX_FIFO_TRIG" width="2" begin="7" end="6" resetval="0x0" description="Sets the trigger level for the RX FIFO:  If SCR[7] = 0 and TLR[7:4] = 0000:  00:   8 characters 01: 16 characters 10: 56 characters 11: 60 characters  If SCR[7] = 0 and TLR[7:4] != 0000, RX_FIFO_TRIG is not considered.  If SCR[7]=1, RX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1." range="7 - 6" rwaccess="W"/> 
		<bitfield id="TX_FIFO_TRIG" width="2" begin="5" end="4" resetval="0x0" description="Sets the trigger level for the TX FIFO:  If SCR[6] = 0 and TLR[3:0] = 0000:  00:   8 spaces 01: 16 spaces 10: 32 spaces 11: 56 spaces  If SCR[6] = 0 and TLR[3:0] != 0000, TX_FIFO_TRIG is not considered.  If SCR[6]=1, TX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1" range="5 - 4" rwaccess="W"/> 
		<bitfield id="DMA_MODE" width="1" begin="3" end="3" resetval="0x0" description="This register is considered if SCR[0] = 0." range="3" rwaccess="W"/> 
		<bitfield id="TX_FIFO_CLEAR" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="W"/> 
		<bitfield id="RX_FIFO_CLEAR" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="W"/> 
		<bitfield id="FIFO_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="W"/>
	</register>
	<register id="MEM_IIR_CIR" acronym="MEM_IIR_CIR" offset="0x8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_IIR_IRDA" acronym="MEM_IIR_IRDA" offset="0x8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/> 
		<bitfield id="STS_FIFO_IT" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R"/> 
		<bitfield id="RX_FIFO_LAST_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_IIR_UART" acronym="MEM_IIR_UART" offset="0x8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="FCR_MIRROR" width="2" begin="7" end="6" resetval="0x0" description="Mirror the contents of FCR[0] on both bits." range="7 - 6" rwaccess="R"/> 
		<bitfield id="IT_TYPE" width="5" begin="5" end="1" resetval="0x0" description="" range="5 - 1" rwaccess="R"/> 
		<bitfield id="IT_PENDING" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_LCR" acronym="MEM_LCR" offset="0xC" width="32" description="LCR[6:0] define parameters of the transmission and reception.

